Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# template.pin_note
source: The new environment keeps the exact template version above. If this workspace already has an environment, it keeps its own version and data unchanged.
zh_hans: 新环境固定使用上述模板版本；若该工作区已有环境，原有环境的版本和数据保持不变。

# template.preparing
source: Preparing…
zh_hans: 准备中…

# template.registered_unverified
source: Added, but not verified
zh_hans: 已添加但未通过验证

# template.retry
source: Retry
zh_hans: 重试

# template.section
source: Template
zh_hans: 模板

# template.summary.basic
source: Common shell commands, Python/pip/venv/numpy, Node.js/npm and HTTPS trust.
zh_hans: 常用 Shell 命令，Python/pip/venv/numpy，Node.js/npm，以及 HTTPS 信任。

# template.summary.dev_document
source: Everything in Basic, plus git, network diagnostics, the C/C++ toolchain, pandas and a document-ready Python stack (pinned python-pptx/pdfplumber wheels).
zh_hans: 在基础模板上加入 git、网络诊断、C/C++ 构建链、pandas 与文档处理 Python 栈（含固定版本 python-pptx/pdfplumber）。

# template.unverified_reason_default
source: This template did not pass verification and is temporarily unavailable.
zh_hans: 模板验证未通过，暂时无法使用。

# template.verified
source: Verified
zh_hans: 已验证可用

# template.verified_registered
source: Template verified and added.
zh_hans: 模板已验证并添加。

# template.version_digest
source: Version %1$@ · %2$@…
zh_hans: 版本 %1$@ · %2$@…

# template.version_label
source: Version
zh_hans: 版本

# template.workspace
source: Workspace
zh_hans: 工作区

# terminal.end_session
source: End Session
zh_hans: 结束会话

# terminal.hide
source: Hide
zh_hans: 收起

# terminal.input
source: Command input
zh_hans: 命令输入

# terminal.linux.download_start
source: Download and Start Linux
zh_hans: 下载并启动 Linux

# terminal.linux.retry
source: Retry Download
zh_hans: 重试下载

# terminal.linux.size_checking
source: Checking size…
zh_hans: 正在检查大小…

# terminal.linux.title
source: Linux isn't installed
zh_hans: 未安装 Linux

# terminal.linux_image_install_card.cancel
source: Cancel
zh_hans: 取消

# terminal.no_output
source: No terminal output
zh_hans: 暂无终端输出

# terminal.restart
source: Restart
zh_hans: 重新启动

# terminal.send
source: Send
zh_hans: 发送

# terminal.start
source: Start Local Terminal
zh_hans: 启动本地终端

# terminal.starting
source: Starting…
zh_hans: 正在启动…

# terminal.status.closed
source: Closed
zh_hans: 已关闭

# terminal.status.exited
source: Exited
zh_hans: 已结束

# terminal.status.exited_code
source: Exited (%lld)
zh_hans: 已结束（%lld）

# terminal.status.not_started
source: Not started
zh_hans: 尚未启动

# terminal.status.running
source: Running
zh_hans: 运行中

# terminal.status.starting
source: Starting local terminal…
zh_hans: 正在启动本地终端…

# terminal.status.waiting_output
source: Connected, waiting for output
zh_hans: 已连接，等待输出

# terminal.title
source: Local Terminal
zh_hans: 本地终端

# thread.collapse
source: Collapse
zh_hans: 折叠

# thread.contacting_provider
source: Contacting the provider…
zh_hans: 正在连接模型服务…

# thread.empty
source: No activity yet
zh_hans: 暂无活动

# thread.empty.hint
source: Send a task to start the thread.
zh_hans: 发送一个任务即可开始线程。

# thread.expand
source: Expand
zh_hans: 展开

# thread.finishing
source: Finishing…
zh_hans: 正在完成…

# thread.kind.approval
source: Approval
zh_hans: 批准

# thread.kind.assistant
source: Assistant
zh_hans: 助手

# thread.kind.checkpoint
source: Checkpoint
zh_hans: 检查点

# thread.kind.error
source: Error
zh_hans: 错误

# thread.kind.file
source: File
zh_hans: 文件

# thread.kind.reasoning
source: Reasoning
zh_hans: 推理

# thread.kind.status
source: Status
zh_hans: 状态

# thread.kind.terminal
source: Terminal
zh_hans: 终端

# thread.kind.tool_request
source: Tool request
zh_hans: 工具请求

# thread.kind.tool_result
source: Tool result
zh_hans: 工具结果

# thread.kind.usage
source: Usage
zh_hans: 用量

# thread.model_thinking
source: The model is thinking…
zh_hans: 模型正在思考…

# thread.no_final_reply
source: The model did not return a final reply.
zh_hans: 模型未返回最终回复。

# thread.role.assistant
source: Assistant
zh_hans: 助手

# thread.role.user
source: You
zh_hans: 我

# thread.run_at
source: Run started at
zh_hans: 运行开始于

# thread.send
source: Send
zh_hans: 发送

# thread.state
source: Run state
zh_hans: 运行状态

# thread.state.cancelling
source: Stopping
zh_hans: 正在停止

# thread.state.checkpointed
source: Stopped
zh_hans: 已停止

# thread.state.completed
source: Completed
zh_hans: 已完成

# thread.state.executing_tool
source: Running a tool
zh_hans: 正在执行工具

# thread.state.failed
source: Failed
zh_hans: 运行失败

# thread.state.preparing
source: Preparing
zh_hans: 正在准备

# thread.state.streaming
source: Generating
zh_hans: 正在生成

# thread.state.waiting_approval
source: Waiting for approval
zh_hans: 等待授权

# thread.title
source: Thread
zh_hans: 线程

# tool.duration.ms
source: %d ms
zh_hans: %d 毫秒

# tool.duration.s
source: %.1f s
zh_hans: %.1f 秒

# tool.input
source: Input
zh_hans: 输入

# tool.output
source: Output
zh_hans: 输出

source: Tool result
zh_hans: 工具结果

# tool.status.cancelled
source: Cancelled
zh_hans: 已取消

# tool.status.denied
source: Denied
zh_hans: 已拒绝

# tool.status.expired
source: Expired
zh_hans: 已过期

# tool.status.failed
source: Failed
zh_hans: 失败

# tool.status.needsUser
source: Needs Input
zh_hans: 需要处理

# tool.status.pending
source: Pending
zh_hans: 待执行

# tool.status.running
source: Running
zh_hans: 执行中

# tool.status.succeeded
source: Succeeded
zh_hans: 成功

# tool.status.unknown
source: Unknown
zh_hans: 状态未知

# trust.fingerprint
source: Fingerprint
zh_hans: 指纹

# trust.host
source: Host
zh_hans: 主机

# trust.key_type
source: Key type
zh_hans: 密钥类型

# trust.reject
source: Reject
zh_hans: 拒绝

# trust.title
source: Trust Host Key?
zh_hans: 信任主机密钥？

# trust.trust
source: Trust
zh_hans: 信任

# trust.verify.hint
source: Verify this fingerprint out-of-band before trusting.
zh_hans: 信任前请通过带外方式核对此指纹。

# vnc.unavailable
source: The VNC session is not available.
zh_hans: VNC 会话不可用。

# voice.failed
source: Voice input stopped unexpectedly. Try again.
zh_hans: 语音输入意外停止，请重试。

# voice.file_speech_transcriber.apple_speech_recognition_timed_out_please
source: Apple speech recognition timed out; please try again.
zh_hans: Apple 语音识别超时，请重试。

# voice.file_speech_transcriber.could_not_read_the_asset_s
source: Could not read the asset's audio track.
zh_hans: 无法读取素材的音轨。

# voice.file_speech_transcriber.no_usable_speech_recognized
source: No usable speech recognized.
zh_hans: 没有识别到可用语音。

# voice.file_speech_transcriber.whisper_is_unavailable_and_apple_speech
source: Whisper is unavailable and Apple speech recognition could not start. Check the model and microphone permission.
zh_hans: Whisper 不可用，Apple 语音识别也无法启动。请检查模型和语音权限。

# voice.hint
source: Dictates text into the message field
zh_hans: 将语音转写到消息输入框

# voice.no_input
source: No microphone input is available.
zh_hans: 没有可用的麦克风输入。

# voice.open_settings
source: Open Settings
zh_hans: 打开设置

# voice.permission_required
source: Allow Microphone and Speech Recognition in Settings to use voice input.
zh_hans: 请在系统设置中允许麦克风和语音识别，以使用语音输入。

# voice.start
source: Start voice input
zh_hans: 开始语音输入

# voice.state.idle
source: Microphone ready
zh_hans: 麦克风就绪

# voice.state.listening
source: Listening
zh_hans: 正在聆听

# voice.state.preparing
source: Preparing speech recognition
zh_hans: 正在准备语音识别

# voice.state.requesting
source: Requesting microphone permission
zh_hans: 正在请求麦克风权限

# voice.state.stopping
source: Stopping
zh_hans: 正在停止

# voice.stop
source: Stop voice input
zh_hans: 停止语音输入

# voice.unavailable
source: Speech recognition is currently unavailable.
zh_hans: 语音识别当前不可用。

# voice.whisper_model_store.speech_recognition_is_using_the_model
source: Speech recognition is using the model; wait for it to finish.
zh_hans: 语音识别正在使用模型，请结束后再操作。

# voice.whisper_model_store.the_whisper_model_is_not_installed
source: The Whisper model is not installed yet.
zh_hans: Whisper 模型尚未安装。

# voice.whisper_model_store.the_whisper_resources_are_incomplete_or
source: The Whisper resources are incomplete or failed verification; download them again.
zh_hans: Whisper 资源不完整或校验失败，请重新下载。

# voice.whisper_settings_view.cancel_download
source: Cancel download
zh_hans: 取消下载

# voice.whisper_settings_view.download_model
source: Download model
zh_hans: 下载模型

# voice.whisper_settings_view.download_model_again
source: Download model again
zh_hans: 重新下载模型

# voice.whisper_settings_view.downloaded
source: Downloaded %@ / %@
zh_hans: 已下载 %@ / %@

# voice.whisper_settings_view.english_mandarin_and_mixed_speech_prefer
source: English, Mandarin and mixed speech prefer on-device Whisper; fall back to Apple speech recognition when the model is unavailable or recognition fails.
zh_hans: 英语、普通话及混合语音优先使用本地 Whisper；模型不可用或识别失败时回退 Apple 语音识别。

# voice.whisper_settings_view.not_installed_yet_currently_using_apple
source: Not installed yet; currently using Apple speech recognition.
zh_hans: 尚未安装，当前使用 Apple 语音识别。

# voice.whisper_settings_view.on_device_recognition
source: On-device recognition
zh_hans: 本地识别

# voice.whisper_settings_view.remove_model
source: Remove model
zh_hans: 移除模型

# voice.whisper_settings_view.speech_recognition
source: Speech recognition
zh_hans: 语音识别

# voice.whisper_settings_view.the_download_uses_about_500_mb
source: The download uses about 500 MB. Audio is not uploaded to the Whisper service; the Apple fallback path follows the system speech services and permission settings. Recognition speed for long recordings depends on device performance.
zh_hans: 下载会占用约 500 MB 空间。音频不会上传给 Whisper 服务；Apple 回退路径遵循系统语音服务和权限设置。长录音的识别速度取决于设备性能。

# voice.whisper_settings_view.the_model_is_installed_the_runtime
source: The model is installed; the runtime still checks whether it can load.
zh_hans: 模型已安装，运行时仍需检查能否加载。

# voice.whisper_settings_view.whisper_small_multilingual
source: Whisper Small · Multilingual
zh_hans: Whisper Small · 多语言

# websearch.display_name
source: Display name
zh_hans: 显示名称

# websearch.endpoint
source: Custom endpoint (optional)
zh_hans: 自定义端点（可选）

# websearch.providers
source: Search providers
zh_hans: 搜索供应商

# websearch.providers.footer
source: Search uses the first available provider and can query several providers concurrently in Deep mode. Keys are stored in Keychain; provider preferences sync through iCloud.
zh_hans: 搜索会优先使用可用供应商，深度模式可并发查询多个供应商。密钥存入钥匙串，供应商偏好通过 iCloud 同步。

# websearch.title
source: Web Search
zh_hans: 联网搜索

# workbench.new_task
source: New task
zh_hans: 新建任务

# workbench.task_changes_inspector_view.after_the_current_task_modifies_files
source: After the current task modifies files, changes and verifiable diffs appear here.
zh_hans: 当前任务修改文件后，变更和可验证 diff 会显示在这里。

# workbench.task_changes_inspector_view.changed
source: Changed
zh_hans: 修改

# workbench.task_changes_inspector_view.delete
source: Delete
zh_hans: 删除

# workbench.task_changes_inspector_view.file_operations
source: %@ file operations
zh_hans: %@ 个文件操作

# workbench.task_changes_inspector_view.no_file_changes
source: No file changes
zh_hans: 暂无文件变更

# workbench.task_changes_inspector_view.write
source: Write
zh_hans: 写入

# workbench.task_inspector_views.always_retry_automatically
source: Always retry automatically
zh_hans: 总是自动重试

# workbench.task_inspector_views.approvals_and_exceptions
source: Approvals and exceptions
zh_hans: 审批与异常

# workbench.task_inspector_views.auto_resume_from_safety_point
source: Auto-resume from safety point
zh_hans: 安全点自动恢复

# workbench.task_inspector_views.background_recovery
source: Background recovery
zh_hans: 后台恢复

# workbench.task_inspector_views.budget_parent_run
source: Budget %@ · parent run %@
zh_hans: 预算 %@ · 父运行 %@

# workbench.task_inspector_views.changes_save_automatically_and_apply_to
source: Changes save automatically and apply to the current run's next tool call.
zh_hans: 修改会自动保存，并立即应用到当前运行的下一次工具调用。

# workbench.task_inspector_views.choose_a_task
source: Choose a task
zh_hans: 请选择任务

# workbench.task_inspector_views.completion_failure_only
source: Completion/failure only
zh_hans: 仅完成/失败

# workbench.task_inspector_views.confirm_enabling_full_access_for_this
source: Confirm enabling Full Access for this task
zh_hans: 确认本任务启用完全访问权限

# workbench.task_inspector_views.no_run_progress_yet
source: No run progress yet
zh_hans: 暂无运行进度

# workbench.task_inspector_views.no_sub_agents
source: No sub-agents
zh_hans: 暂无子 Agent

# workbench.task_inspector_views.notifications
source: Notifications
zh_hans: 通知

# workbench.task_inspector_views.routine_in_scope_steps_toward_the
source: Routine in-scope steps toward the current task are allowed automatically; the approval model steps in only when the goal is unclear, permissions expand significantly, or there is a high-risk consequence.
zh_hans: 以完成当前任务为目标自动放行范围内的常规步骤；审批模型只在目标不明确、权限明显扩大或存在高风险后果时介入。

# workbench.task_inspector_views.saved_and_applied_to_the_current
source: Saved and applied to the current task
zh_hans: 已保存并应用到当前任务

# workbench.task_inspector_views.stage_progress
source: Stage progress
zh_hans: 阶段进度

# workbench.task_inspector_views.task_settings
source: Task settings
zh_hans: 任务设置

# workbench.task_inspector_views.the_task_remains_limited_by_workspace
source: The task remains limited by workspace and tool scope; catastrophic commands are always blocked.
zh_hans: 任务仍受工作区和工具范围限制；灾难性命令始终阻止。

# workbench.task_inspector_views.this_task
source: This task
zh_hans: 本任务

# workbench.task_inspector_views.tools_for_this_task_run_automatically
source: Tools for this task run automatically; catastrophic commands are always blocked and package installation still requires model review.
zh_hans: 本任务工具自动执行；灾难性命令始终阻止，软件包安装仍需模型审查。

# workspace.add
source: Add workspace
zh_hans: 添加工作区

# workspace.canvas3_d_director_view.add_object
source: Add object
zh_hans: 添加对象

# workspace.canvas3_d_director_view.after_selecting_an_object_adjust_position
source: After selecting an object, adjust position, rotation, size and material in the properties bar.
zh_hans: 选择对象后在属性栏调整位置、旋转、尺寸与材质。

# workspace.canvas3_d_director_view.background
source: Background
zh_hans: 背景

# workspace.canvas3_d_director_view.cone
source: Cone
zh_hans: 圆锥体

# workspace.canvas3_d_director_view.copy
source: Copy
zh_hans: 副本

# workspace.canvas3_d_director_view.cube
source: Cube
zh_hans: 立方体

# workspace.canvas3_d_director_view.cylinder
source: Cylinder
zh_hans: 圆柱体

# workspace.canvas3_d_director_view.delete_object
source: Delete object
zh_hans: 删除对象

# workspace.canvas3_d_director_view.discard_this_edit_and_return_to
source: Discard this edit and return to canvas
zh_hans: 不保存本次修改并返回画布

# workspace.canvas3_d_director_view.drag_to_rotate_the_view
source: Drag to rotate the view
zh_hans: 拖动旋转视角

# workspace.canvas3_d_director_view.duplicate_object
source: Duplicate object
zh_hans: 复制对象

# workspace.canvas3_d_director_view.exit_3d_director
source: Exit 3D Director
zh_hans: 退出 3D 导演台

# workspace.canvas3_d_director_view.graphite_gray
source: Graphite gray
zh_hans: 石墨灰

# workspace.canvas3_d_director_view.green_screen
source: Green screen
zh_hans: 绿幕

# workspace.canvas3_d_director_view.hide
source: Hide
zh_hans: 隐藏

# workspace.canvas3_d_director_view.material
source: Material
zh_hans: 材质

# workspace.canvas3_d_director_view.material_color
source: Material color %@
zh_hans: 材质颜色 %@

# workspace.canvas3_d_director_view.metal_material
source: Metal material
zh_hans: 金属材质

# workspace.canvas3_d_director_view.midnight_blue
source: Midnight blue
zh_hans: 午夜蓝

# workspace.canvas3_d_director_view.object
source: Object
zh_hans: 对象

# workspace.canvas3_d_director_view.pinch_to_zoom
source: Pinch to zoom
zh_hans: 双指缩放

# workspace.canvas3_d_director_view.plane
source: Plane
zh_hans: 平面

# workspace.canvas3_d_director_view.reset_view
source: Reset view
zh_hans: 重置视角

# workspace.canvas3_d_director_view.roughness
source: Roughness
zh_hans: 粗糙度

# workspace.canvas3_d_director_view.scale
source: Scale
zh_hans: 缩放

# workspace.canvas3_d_director_view.scene_objects
source: Scene objects
zh_hans: 场景对象

# workspace.canvas3_d_director_view.scene_properties
source: Scene properties
zh_hans: 场景属性

# workspace.canvas3_d_director_view.select_an_object
source: Select an object
zh_hans: 选择一个对象

# workspace.canvas3_d_director_view.select_an_object_on_the_left
source: Select an object on the left, or add a new shape.
zh_hans: 从左侧选择对象，或添加新的几何体。

# workspace.canvas3_d_director_view.show_ground_grid
source: Show ground grid
zh_hans: 显示地面网格

# workspace.canvas3_d_director_view.sphere
source: Sphere
zh_hans: 球体

# workspace.canvas3_d_director_view.stage
source: Stage
zh_hans: 舞台

# workspace.canvas3_d_director_view.studio
source: Studio
zh_hans: 摄影棚

# workspace.canvas_agent_tools.canvas_text_references
source: %@ Canvas text references: %@
zh_hans: %@ 画布文字引用： %@

# workspace.canvas_agent_tools.generation_failed_retry_from_the_configuration
source: Generation failed; retry from the configuration node
zh_hans: 生成失败，可从配置节点重试

# workspace.canvas_backup_package.cad_draft
source: CAD draft
zh_hans: CAD 草稿

# workspace.canvas_backup_package.cad_draft_description
source: CAD draft description
zh_hans: CAD 草稿描述

# workspace.canvas_backup_package.cad_draft_drawing
source: CAD draft drawing
zh_hans: CAD 草稿图纸

# workspace.canvas_backup_package.cad_draft_drawing_file_is_missing
source: CAD draft drawing file is missing: %@
zh_hans: CAD 缺少草稿图纸文件：%@

# workspace.canvas_backup_package.cad_history_versions
source: CAD history versions
zh_hans: CAD 历史版本

# workspace.canvas_backup_package.canvas_backup_format_version_is_not
source: Canvas backup format version %@ is not supported; update the app before importing.
zh_hans: 画布备份格式版本 %@ 不受支持，请升级应用后再导入。

# workspace.canvas_backup_package.canvas_backup_verification_failed
source: Canvas backup verification failed: %@
zh_hans: 画布备份校验失败：%@

# workspace.canvas_backup_package.canvas_backups_do_not_include_any
source: Canvas backups do not include any documents.
zh_hans: 画布备份不包含任何文档。

# workspace.canvas_backup_package.canvas_json_is_missing
source: canvas.json is missing.
zh_hans: 缺少 canvas.json。

# workspace.canvas_backup_package.could_not_create_the_backup_archive
source: Could not create the backup archive.
zh_hans: 无法创建备份存档。

# workspace.canvas_backup_package.could_not_read_the_backup_archive
source: Could not read the backup archive.
zh_hans: 无法读取备份存档。

# workspace.canvas_backup_package.could_not_read_the_cad_draft
source: Could not read the CAD draft directory.
zh_hans: 无法读取 CAD 草稿目录。

# workspace.canvas_backup_package.could_not_stage_the_cad_draft
source: Could not stage the CAD draft.
zh_hans: 无法暂存 CAD 草稿。

# workspace.canvas_backup_package.could_not_unzip
source: Could not unzip %@.
zh_hans: 无法解压 %@。

# workspace.canvas_backup_package.different_sub_projects_reference_an_asset
source: Different sub-projects reference an asset at the same relative path but different locations: %@.
zh_hans: 不同子工程引用了同一相对路径但位置不同的素材：%@。

# workspace.canvas_backup_package.duplicate_entry
source: Duplicate entry %@.
zh_hans: 重复条目 %@。

# workspace.canvas_backup_package.engineering_assets
source: Engineering assets
zh_hans: 工程素材

# workspace.canvas_backup_package.exceeds_the_size_limit
source: %@ exceeds the size limit.
zh_hans: %@ 超过大小限制。

# workspace.canvas_backup_package.is_not_a_regular_file
source: %@ is not a regular file.
zh_hans: %@ 不是常规文件。

# workspace.canvas_backup_package.manifest_json_is_missing
source: manifest.json is missing.
zh_hans: 缺少 manifest.json。

# workspace.canvas_backup_package.missing
source: Missing %@ %@.
zh_hans: 缺少 %@ %@。

# workspace.canvas_backup_package.node_asset
source: Node asset
zh_hans: 节点素材

# workspace.canvas_backup_package.points_outside_the_workspace
source: %@ points outside the workspace.
zh_hans: %@ 指向工作区之外。

# workspace.canvas_backup_package.pre_export_checks_failed
source: Pre-export checks failed: %@
zh_hans: 导出前检查未通过：%@

# workspace.canvas_backup_package.sub_project
source: Sub-project %@
zh_hans: 子工程 %@

# workspace.canvas_backup_package.sub_project_2
source: Sub-project
zh_hans: 子工程

# workspace.canvas_backup_package.sub_project_is_not_valid_json
source: Sub-project %@ is not valid JSON.
zh_hans: 子工程 %@ 不是有效 JSON。

# workspace.canvas_backup_package.sub_project_is_not_valid_project
source: Sub-project %@ is not valid project JSON.
zh_hans: 子工程 %@ 不是有效工程 JSON。

# workspace.canvas_backup_package.the_backup_exceeds_2_gb
source: The backup exceeds 2 GB.
zh_hans: 备份超过 2 GB。

# workspace.canvas_backup_package.the_backup_exceeds_the_size_limit
source: The backup exceeds the size limit (64 MB for in-memory export, 2 GB for file export).
zh_hans: 备份超过大小限制（内存导出 64 MB，文件导出 2 GB）。

# workspace.canvas_backup_package.the_backup_exceeds_the_size_limit_2
source: The backup exceeds the size limit.
zh_hans: 备份超过大小限制。

# workspace.canvas_backup_package.the_backup_is_missing_assets_referenced
source: The backup is missing assets referenced by nodes: %@
zh_hans: 备份缺少被节点引用的素材：%@

# workspace.canvas_backup_package.the_backup_is_missing_drawings_assets
source: The backup is missing drawings/assets referenced by nodes: %@
zh_hans: 备份缺少被节点引用的图纸/素材：%@

# workspace.canvas_backup_package.the_backup_is_missing_history_version
source: The backup is missing history version files: %@
zh_hans: 备份缺少历史版本文件：%@

# workspace.canvas_backup_package.the_cad_draft_content_failed_verification
source: The CAD draft content failed verification.
zh_hans: CAD 草稿的内容校验失败。

# workspace.canvas_backup_package.the_cad_draft_description_cannot_be
source: The CAD draft description cannot be parsed.
zh_hans: CAD 草稿描述无法解析。

# workspace.canvas_backup_package.the_cad_draft_exceeds_the_per
source: The CAD draft exceeds the per-item size limit.
zh_hans: CAD 草稿超过单条目大小限制。

# workspace.canvas_backup_package.the_cad_draft_is_empty
source: The CAD draft is empty.
zh_hans: CAD 草稿内容为空。

# workspace.canvas_backup_package.the_cad_draft_is_missing_a
source: The CAD draft is missing a drawing format.
zh_hans: CAD 草稿缺少图纸格式。

# workspace.canvas_backup_package.the_cad_draft_ownership_failed_verification
source: The CAD draft ownership failed verification.
zh_hans: CAD 草稿的归属校验失败。

# workspace.canvas_backup_package.the_cad_draft_ownership_or_path
source: The CAD draft ownership or path is not secure.
zh_hans: CAD 草稿的归属或路径不安全。

# workspace.canvas_backup_package.the_cad_draft_path_does_not
source: The CAD draft path does not match its ownership.
zh_hans: CAD 草稿路径与归属不一致。

# workspace.canvas_backup_package.the_cad_draft_restore_path_is
source: The CAD draft restore path is not secure.
zh_hans: CAD 草稿恢复路径不安全。

# workspace.canvas_backup_package.the_canvas_backup_contains_an_insecure
source: The canvas backup contains an insecure path: %@
zh_hans: 画布备份包含不安全路径：%@

# workspace.canvas_backup_package.the_canvas_backup_is_damaged
source: The canvas backup is damaged: %@
zh_hans: 画布备份已损坏：%@

# workspace.canvas_backup_package.the_entry_exceeds_the_size_limit
source: The entry exceeds the size limit.
zh_hans: 条目超过大小限制。

# workspace.canvas_backup_package.the_node_asset_is_not_in
source: The node asset is not in a backup location: %@
zh_hans: 节点素材不在可备份位置：%@

# workspace.creative_asset_ingestion_service.reference_image
source: Reference image
zh_hans: 参考图

# workspace.creative_asset_ingestion_service.the_asset_url_is_not_secure
source: The asset URL is not secure. Only public HTTPS images are supported; local or private networks cannot be accessed.
zh_hans: 素材网址不安全。仅支持公开 HTTPS 图片，不能访问本机或私有网络。

# workspace.creative_asset_ingestion_service.the_download_is_not_a_supported
source: The download is not a supported image, or its dimensions exceed the safety limit.
zh_hans: 下载内容不是受支持的图片，或图片尺寸超过安全限制。

# workspace.creative_asset_ingestion_service.the_image_server_returned_no_usable
source: The image server returned no usable image response.
zh_hans: 图片服务器没有返回可用的图片响应。

# workspace.creative_asset_ingestion_service.the_reference_asset_has_not_been
source: The reference asset has not been downloaded to this device; reimport it before generating.
zh_hans: 参考素材尚未下载到本机，请重新导入后再生成。
